{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "CNN1_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "name": "CNN1_input"}, "inbound_nodes": []}, {"name": "CNN1", "class_name": "Conv2D", "config": {"name": "CNN1", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["CNN1_input", 0, 0, {}]]]}, {"name": "MaxPool1", "class_name": "MaxPooling2D", "config": {"name": "MaxPool1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["CNN1", 0, 0, {}]]]}, {"name": "CNN2", "class_name": "Conv2D", "config": {"name": "CNN2", "trainable": true, "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool1", 0, 0, {}]]]}, {"name": "MaxPool2", "class_name": "MaxPooling2D", "config": {"name": "MaxPool2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["CNN2", 0, 0, {}]]]}, {"name": "Flatten", "class_name": "Flatten", "config": {"name": "Flatten", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["MaxPool2", 0, 0, {}]]]}], "input_layers": [["CNN1_input", 0, 0]], "output_layers": [["Flatten", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}